In [4]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
from pandasql import sqldf
from sqlalchemy import create_engine

In [5]:
connection_to_db = create_engine('sqlite:///associations.db')

In [6]:
%load_ext sql
%sql sqlite:///associations.db

In [7]:
%%sql
select * from associations_cross limit 5;

 * sqlite:///associations.db
Done.

[(1025503, 412914, 413772, '2021-04-01 00:00:00.088007', '2021-04-01 00:00:21.692255', None, None),
 (1025503, 412914, 412996, '2021-04-01 00:00:00.088007', '2021-04-01 00:00:29.930613', None, None),
 (1025503, 412914, 416512, '2021-04-01 00:00:00.088007', '2021-04-01 00:00:34.193936', None, None),
 (1025503, 412914, 415462, '2021-04-01 00:00:00.088007', '2021-04-01 00:00:48.611063', None, None),
 (1025503, 412914, 415462, '2021-04-01 00:00:00.088007', '2021-04-01 00:01:08.961677', None, None)]

In [17]:
%%sql 
alter table associations_cross
drop column time_diff;

 * sqlite:///associations.db
(sqlite3.OperationalError) near "drop": syntax error
[SQL: alter table associations_cross drop column time_diff;]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [18]:
%%sql
select * from associations_cross limit 5;

 * sqlite:///associations.db
Done.

[(1025503, 412914, 413772, '2021-04-01 00:00:00.088007', '2021-04-01 00:00:21.692255', None, None),
 (1025503, 412914, 412996, '2021-04-01 00:00:00.088007', '2021-04-01 00:00:29.930613', None, None),
 (1025503, 412914, 416512, '2021-04-01 00:00:00.088007', '2021-04-01 00:00:34.193936', None, None),
 (1025503, 412914, 415462, '2021-04-01 00:00:00.088007', '2021-04-01 00:00:48.611063', None, None),
 (1025503, 412914, 415462, '2021-04-01 00:00:00.088007', '2021-04-01 00:01:08.961677', None, None)]

In [ ]:
%%sql 
create table results as select
ap_1,
ap_2,
t1,
t2 from associations_cross;

In [16]:
# function to compute time given two timestamps
def time_difference(t1, t2):
  str1 = t1.split()
  str2 = t2.split()
  FMT = '%H:%M:%S.%f'
  tdelta = datetime.strptime(str2[1], FMT) - datetime.strptime(str1[1], FMT)
  return tdelta

In [ ]:
res = %sql select * from associations_cross
res_df = res.DataFrame()

 * sqlite:///associations.db
Done.

In [1]:
res_df

NameError: name 'res_df' is not defined